[
  {
    "url": "http://localhost:3000/mma4.html",
    "input": "Fast-forward to the 1980s and Terry Norris of Lubbock, Texas was a big name in the light-middleweight division. He held the title of world champion four times during the ’80s and ’90s. Norris was recognized for his contribution to the sport in 2005 when he became an International Boxing Hall of Famer.",
    "output": [
      "<strong>From Welterweight to Hollywood: Terry Norris's Knockout Journey</strong>",
      "- Did you know that Terry Norris actually started his boxing career as a welterweight before moving up to the light-middleweight division? His decision to change weight classes proved to be a successful move, as he went on to become a dominant force in his new division.",
      "- Norris had an impressive knockout record throughout his career, with a total of 31 knockouts out of his 47 victories. This highlights his incredible punching power and ability to finish fights in a decisive manner.",
      "- In addition to his boxing accomplishments, Norris also had a brief acting career. He appeared in the 1990 film \"Rocky V\" as himself, showcasing his popularity and recognition within the boxing world.",
      "- Despite his success in the ring, Norris faced some personal struggles outside of boxing. In the late 1990s, he battled drug addiction and spent time in rehab. However, he managed to overcome his addiction and has since become an advocate for substance abuse awareness and recovery.",
      "- Terry Norris comes from a family with a strong boxing background. His brother, Orlin Norris, was also a professional boxer who held the WBA cruiserweight title. The Norris brothers' success in the sport is a testament to their shared talent and dedication to boxing."
    ],
    "content_type": "tangential tidbits"
  },
  {
    "url": "https://www.fightbookmma.com/5-of-the-best-texas-boxers/",
    "input": "Fast-forward to the 1980s and Terry Norris of Lubbock, Texas was a big name in the light-middleweight division. He held the title of world champion four times during the ’80s and ’90s. Norris was recognized for his contribution to the sport in 2005 when he became an International Boxing Hall of Famer.",
    "output": [
      "<strong>From Welterweight to Hollywood: Terry Norris's Knockout Journey</strong>",
      "- Did you know that Terry Norris actually started his boxing career as a welterweight before moving up to the light-middleweight division? His decision to change weight classes proved to be a successful move, as he went on to become a dominant force in his new division.",
      "- Norris had an impressive knockout record throughout his career, with a total of 31 knockouts out of his 47 victories. This highlights his incredible punching power and ability to finish fights in a decisive manner.",
      "- In addition to his boxing accomplishments, Norris also had a brief acting career. He appeared in the 1990 film \"Rocky V\" as himself, showcasing his popularity and recognition within the boxing world.",
      "- Despite his success in the ring, Norris faced some personal struggles outside of boxing. In the late 1990s, he battled drug addiction and spent time in rehab. However, he managed to overcome his addiction and has since become an advocate for substance abuse awareness and recovery.",
      "- Terry Norris comes from a family with a strong boxing background. His brother, Orlin Norris, was also a professional boxer who held the WBA cruiserweight title. The Norris brothers' success in the sport is a testament to their shared talent and dedication to boxing."
    ],
    "content_type": "tangential tidbits"
  },
  {
    "url": "https://www.fightbookmma.com/ufc-on-espn-50-bonus-winners-sandhagen-vs-font/",
    "input": "In the main event, Cory Sandhagen fighting out of Aurora, Colorado will face Rob Font fighting out of Boston, Massachusetts. In the co-main event, we will see Jessica Andrade fighting out of Parana, Brazil take on Tatiana Suarez fighting out of Rancho Cucamonga, California.",
    "output": [
      "<strong> Explosive Striker Cory Sandhagen Set to Impress </strong>",
      "Did you know that Cory Sandhagen, who will be fighting in the main event, holds a record for the fastest knockout in bantamweight history in the UFC? In just 28 seconds, Sandhagen delivered a flying knee to his opponent, Marlon Moraes, securing a stunning victory. Keep an eye out for Sandhagen's explosive striking skills in his upcoming fight against Rob Font."
    ],
    "content_type": "contrarian viewpoint"
  },
  {
    "url": "https://www.fightbookmma.com/the-ultimate-experience-weekend-coming-to-atlantic-city-from-august-25-august-27/",
    "input": "The Ultimate Experience Weekend begins with the prestigious Sweetest Soul of Boxing Gala on Friday, August 25th. This evening of elegance is dedicated to honoring the legacy of the Late Great Weatta Frazier Collins, daughter of the legendary “Smokin” Joe Frazier, who founded “The Legacy Exists” Joe Frazier Scholarship fund. Spearheading the movement now are her brother, Joe Frazier Jr., and his wife, Mis Downing Frazier, who continue her legacy with unwavering dedication. Esteemed guests who are being presented with the Sweetest Soul of Boxing humanitarian award include boxing legend Roy Jones Jr. and Atlantic City’s Mayor Marty Small, who will join us for this unforgettable evening filled with enchanting performances, fine dining, and special surprises.",
    "output": [
      "<strong>Sweetest Soul of Boxing Gala</strong>",
      "The Sweetest Soul of Boxing Gala has become an annual event that celebrates the legacy of Weatta Frazier Collins and the impact she had on the boxing community. Each year, esteemed guests gather at the gala to honor individuals who have made significant humanitarian contributions to the world of boxing. Through enchanting performances, fine dining, and special surprises, the gala ensures that Weatta's legacy lives on in a truly unforgettable way."
    ],
    "content_type": "history"
  },
  {
    "url": "https://www.fightbookmma.com/combate-global-acosta-vs-juaneda-results/",
    "input": "MIAMI – COMBATE GLOBAL: Acosta vs Juaneda took place on Sunday, Aug. 6, 2023, live on Paramount+ from Miami. Below you can find the complete and official results.",
    "output": [
      "<strong>Showdown: Acosta vs Juaneda</strong>",
      "- The event took place at the Watsco Center, known as the home of the Miami Hurricanes men's basketball team.",
      "- Miami has a rich history of hosting combat sports events, with notable boxing matches and MMA fights taking place in the city.",
      "- Combate Global is a promotion that focuses on showcasing Latin American talent in mixed martial arts."
    ],
    "content_type": "tangential tidbits"
  },
  {
    "url": "https://www.fightbookmma.com/ufc-on-espn-50-weigh-in-results-sandhagen-vs-font/",
    "input": "The main card begins at 9 p.m. ET and airs on ESPN, as well as ESPN+. The prelims air on ESPN and stream on ESPN+ beginning at 6 p.m. ET.",
    "output": [
      "<strong>UFC: From Humble Beginnings to Global Sensation</strong>",
      "The first ever UFC event took place on November 12, 1993. It was titled \"UFC 1: The Beginning\" and featured a tournament-style format with fighters from various disciplines. The event took place in Denver, Colorado and was originally created to determine the most effective martial art in a real fight. Today, the UFC is a global phenomenon with millions of fans worldwide."
    ],
    "content_type": "trivia"
  },
  {
    "url": "https://www.fightbookmma.com/exclusive-with-promoter-dmitriy-salita-jarrell-miller-will-do-more-ppv-buys-than-dillian-whyte/",
    "input": "Jarrell Miller vs Anthony Joshua will sell more PPV buys than AJ vs. Whyte 2",
    "output": [
      "<strong>Knockout King: Miller's 23 Straight</strong>",
      "Jarrell Miller holds the record for the most consecutive wins by knockout in the heavyweight division, with a remarkable 23 knockouts in a row."
    ],
    "content_type": "trivia"
  },
  {
    "url": "https://www.fightbookmma.com/mma-veteran-zach-makovsky-wants-to-roll-back-the-years-at-brave-cf-73/",
    "input": "As a kid who always had a strong wrestling pedigree, it’s not too surprising to look back and see that it was his love of martial arts movies that motivated him to really commit to the sport. Ever since then, he’s fought all over the globe, making a name for himself as someone who never goes down without a fight.",
    "output": [
      "<strong>From Ancient Greece to Modern Olympics: The Evolution of Wrestling</strong>",
      "Did you know that wrestling has been a part of the Olympic Games since ancient times? It was one of the original sports in the ancient Olympic Games held in Greece. Wrestling has evolved over the years, with different styles and techniques emerging. As a trivia, did you know that there are three main styles of wrestling in modern Olympics: freestyle, Greco-Roman, and women's freestyle? Each style has its own set of rules and techniques, making wrestling a dynamic and diverse sport."
    ],
    "content_type": "trivia"
  },
  {
    "url": "https://www.fightbookmma.com/exclusive-with-promoter-dmitriy-salita-jarrell-miller-will-do-more-ppv-buys-than-dillian-whyte/",
    "input": "Boxing promoter Dmitriy Salita claims  Jarrel ”Big Baby” Miller will sell more tickets than Dillian Whyte, and even challenged AJ to get over a possible fear of Southpaws by facing Otto Wallin.",
    "output": [
      "<strong>Fighting for Fans: The Power of Boxing Ticket Sales</strong>",
      "Dmitriy Salita, a boxing promoter, recently made headlines with his bold claims about Jarrell \"Big Baby\" Miller's ticket-selling prowess. In the world of boxing, ticket sales have always been a significant aspect of a fighter's success. Historical data shows that some fighters have managed to attract massive crowds, turning their bouts into legendary events. For instance, the \"Fight of the Century\" between Muhammad Ali and Joe Frazier in 1971 drew a crowd of over 20,000 spectators at Madison Square Garden. Similarly, the \"Rumble in the Jungle\" between Muhammad Ali and George Foreman in 1974 captivated over 60,000 fans in Kinshasa, Zaire. These historic moments remind us of the excitement and anticipation surrounding boxing events and how ticket sales have played a crucial role in the sport's legacy."
    ],
    "content_type": "history"
  },
  {
    "url": "https://www.fightbookmma.com/ufc-on-espn-50-weigh-in-results-sandhagen-vs-font/",
    "input": "Buzukja missed the featherweight limit and will forfeit 20 percent of his purse to Woodson.",
    "output": [
      "<strong>The High Stakes of Weight Cuts</strong>",
      "Buzukja's failure to make weight is not an uncommon occurrence in combat sports. Many fighters have struggled with weight cuts, leading to various consequences. These range from losing a portion of their purse, like Buzukja, to being forced to move up in weight class or even being suspended or released from their contract. Weight management is a crucial aspect of a fighter's preparation and can greatly impact their performance in the ring or octagon. These incidents serve as a reminder of the challenges faced by athletes in staying within their designated weight limits."
    ],
    "content_type": "tangential tidbits"
  },
  {
    "url": "https://www.fightbookmma.com/5-of-the-best-texas-boxers/",
    "input": "During the same era, Donald Curry’s career saw him compete in the welterweight division between 1980 and 1991. The fighter from Fort Worth, Texas held a number of titles during his illustrious career, including the WBA world welterweight title between 1983 and 1986, the WBC light middleweight title in 1988, and the undisputed world welterweight title in 1985. 25 of his 34 wins came via KO, and he was entered into the International Boxing Hall of Fame in 2019, alongside fellow Texan Norris.",
    "output": [
      "<strong>The Underrated Legacy of Donald Curry</strong>",
      "Contrarian viewpoint: While Donald Curry had an impressive career in the welterweight division, some critics argue that his success was overshadowed by other fighters of his time. They point to the fact that Curry's reign as the undisputed world welterweight champion lasted only a year, and his title defenses were not as dominant as those of his contemporaries. Additionally, his knockout percentage of 74% is impressive, but it falls short compared to other renowned knockout artists of the era. Critics believe that while Curry was undoubtedly a talented fighter, his legacy may not be as enduring as some may think."
    ],
    "content_type": "contrarian viewpoint"
  },
  {
    "url": "https://www.fightbookmma.com/the-ultimate-experience-weekend-coming-to-atlantic-city-from-august-25-august-27/",
    "input": "Experience Extravagance and Star Power at the Ultimate Experience Weekend at Showboat Hotel, Atlantic City – Mark your calendars for a weekend of unparalleled luxury and excitement as Showboat Hotel proudly presents the Ultimate Experience Weekend from August 25th to 27th, 2023, in Atlantic City. This exclusive event promises to be a one-of-a-kind celebration featuring the Sweetest Soul of Boxing Gala, The Road to Victory Boxing Show, a Water Park After Party, and the Ultimate Cigar Experience, all set in the iconic backdrop of Atlantic City.",
    "output": [
      "<strong>Experience the Showboat: Where History Meets Luxury</strong>",
      "Showboat Hotel has a rich history that dates back to its opening in 1987. Originally built as a casino resort, it quickly became a popular destination for gamblers and entertainment seekers alike. The hotel's prime location on the famous Atlantic City Boardwalk made it a hub for tourists visiting the area.",
      "Over the years, Showboat Hotel has undergone several renovations and changes in ownership. In 2014, it temporarily closed its casino operations but continued to operate as a hotel. Today, the hotel still retains its iconic status and is known for its luxurious accommodations and world-class amenities.",
      "The Ultimate Experience Weekend at Showboat Hotel is a testament to the hotel's storied past and its commitment to providing unforgettable experiences for its guests. As you attend the various events and immerse yourself in the extravaganza, take a moment to appreciate the heritage of Showboat Hotel and its contribution to the vibrant history of Atlantic City."
    ],
    "content_type": "history"
  },
  {
    "url": "https://www.fightbookmma.com/ufc-on-espn-50-weigh-in-results-sandhagen-vs-font/",
    "input": "FigtBook MMA has your weigh-in results for UFC on ESPN: Sandhagen vs. Font (also known as UFC on ESPN 50). This event will take place on August 5, 2023, at Bridgestone Arena in Nashville, Tennessee, United States.",
    "output": [
      "<strong>The Dark Side of UFC</strong>",
      "While many fans eagerly await the upcoming UFC event, critics argue that mixed martial arts (MMA) glorifies violence and poses risks to the fighters' long-term health. They believe that the intense physicality of UFC matches can lead to serious injuries, including concussions and joint damage. Furthermore, some question the ethical implications of promoting a sport that focuses on inflicting harm on opponents for entertainment purposes. These contrarian viewpoints encourage a more introspective approach when engaging with MMA as a spectator. What do you think?"
    ],
    "content_type": "contrarian viewpoint"
  },
  {
    "url": "https://www.fightbookmma.com/jose-torres-gets-acclimatised-ahead-of-brave-cf-73-in-bogota/",
    "input": "In order to get there, though, he must first overcome the gruelling elements at play when he ventures to the Colombian capital of Bogota. With high altitude and tough conditions, “Shorty” knows the task that stands in front of him.",
    "output": [
      "<strong>Discover Bogota's Rich History</strong>",
      "Bogota, the capital city of Colombia, has a rich history that predates its official founding in 1538. Originally inhabited by the indigenous Muisca people, the area was later colonized by the Spanish. As a result, Bogota became an important hub for trade and administration in the region. Over the years, the city has witnessed significant historical events, including the struggle for independence from Spanish rule in the early 19th century. Today, Bogota is a vibrant metropolis that blends modernity with its historical heritage, making it a fascinating destination for history enthusiasts."
    ],
    "content_type": "history"
  },
  {
    "url": "https://www.fightbookmma.com/mma-veteran-zach-makovsky-wants-to-roll-back-the-years-at-brave-cf-73/",
    "input": "In the Colombian capital of Bogota, 40-year-old Zach Makovsky will aim to break a two-fight losing streak and remind the world that he’s still a threat in the flyweight division. The former Bellator champion has been in this game for almost two decades, and in that time, he’s had many highs and many lows.",
    "output": [
      "<strong>From the Cage to Campus: Meet Zach \"Fun Size\" Makovsky</strong>",
      "Did you know that Zach Makovsky is not only a skilled MMA fighter but also a highly educated individual? He holds a degree in political science from Drexel University in Philadelphia. Makovsky's analytical mind and strategic approach to the sport have earned him the nickname \"Fun Size.\""
    ],
    "content_type": "trivia"
  },
  {
    "url": "https://www.fightbookmma.com/ufc-on-espn-50-venum-payout-jessica-andrade-top-earner-with-21000/",
    "input": "In the main event, Cory Sandhagen fighting out of Aurora, Colorado will face Rob Font fighting out of Boston, Massachusetts. In the co-main event, we will see Jessica Andrade fighting out of Parana, Brazil take on Tatiana Suarez fighting out of Rancho Cucamonga, California.",
    "output": [
      "<strong> Explosive Striker Cory Sandhagen Set to Impress </strong>",
      "Did you know that Cory Sandhagen, who will be fighting in the main event, holds a record for the fastest knockout in bantamweight history in the UFC? In just 28 seconds, Sandhagen delivered a flying knee to his opponent, Marlon Moraes, securing a stunning victory. Keep an eye out for Sandhagen's explosive striking skills in his upcoming fight against Rob Font."
    ],
    "content_type": "trivia"
  },
  {
    "url": "https://www.fightbookmma.com/ufc-on-espn-50-weigh-in-results-sandhagen-vs-font/",
    "input": "In the main event, Cory Sandhagen fighting out of Aurora, Colorado will face Rob Font fighting out of Boston, Massachusetts. In the co-main event, we will see Jessica Andrade fighting out of Parana, Brazil take on Tatiana Suarez fighting out of Rancho Cucamonga, California.",
    "output": [
      "<strong>Thrilling UFC Bantamweight Clash</strong>",
      "- Colorado native Cory Sandhagen is known for his creativity and unorthodox striking techniques in the octagon, making him a fan favorite.",
      "- Rob Font, hailing from Boston, has showcased his strong boxing skills, often outclassing his opponents with precise striking and footwork.",
      "- Jessica Andrade's fighting style is characterized by her relentless pressure and powerful slams, which have resulted in some spectacular finishes throughout her career.",
      "- Tatiana Suarez, a former Olympic hopeful in wrestling, has seamlessly transitioned her grappling skills into MMA, dominating her opponents with her superior ground game."
    ],
    "content_type": "tangential tidbits"
  },
  {
    "url": "https://www.fightbookmma.com/combate-global-acosta-vs-juaneda-results/",
    "input": "In the main event, Lucero “La Loba” Acosta squared off with Silvia Juaneda in a flyweight (125 pounds) matchup.",
    "output": [
      "<strong>Critics question flyweight excitement</strong>",
      "While many fans were eagerly awaiting the flyweight matchup between Lucero \"La Loba\" Acosta and Silvia Juaneda, some contrarian viewpoints emerged. Critics argued that the flyweight division lacked the excitement and star power of other weight classes. They claimed that the smaller fighters often lacked the knockout power and aggression that make for thrilling fights. Instead, they argued, fans should focus on the heavyweights or welterweights, where the punches pack more of a punch, so to speak. These contrarians believed that the flyweight matchup was simply not worth the hype and could not provide the same level of entertainment as other weight classes. What do you think?"
    ],
    "content_type": "contrarian viewpoint"
  },
  {
    "url": "http://localhost:3000/mma5.html",
    "input": "Luckily for his fans, he’s already made the trip over and has begun his specialised training – as he noted he would do not so long ago.",
    "output": [
      "\"Game-Changing Travel: Athletes Go Global\"",
      "In the early 20th century, athletes often faced significant challenges when it came to international travel. Long and arduous voyages made it difficult for athletes to compete outside of their home countries. However, advancements in transportation technology, such as the invention of airplanes, revolutionized the sports industry. Athletes like the one mentioned in the original text were able to travel more efficiently and quickly, enabling them to pursue specialized training opportunities in different parts of the world. This marked a turning point in the history of sports, allowing athletes to expand their horizons and showcase their skills on a global stage."
    ],
    "content_type": "history"
  },
  {
    "url": "https://www.fightbookmma.com/jose-torres-gets-acclimatised-ahead-of-brave-cf-73-in-bogota/",
    "input": "Luckily for his fans, he’s already made the trip over and has begun his specialised training – as he noted he would do not so long ago.",
    "output": [
      "\"Game-Changing Travel: Athletes Go Global\"",
      "In the early 20th century, athletes often faced significant challenges when it came to international travel. Long and arduous voyages made it difficult for athletes to compete outside of their home countries. However, advancements in transportation technology, such as the invention of airplanes, revolutionized the sports industry. Athletes like the one mentioned in the original text were able to travel more efficiently and quickly, enabling them to pursue specialized training opportunities in different parts of the world. This marked a turning point in the history of sports, allowing athletes to expand their horizons and showcase their skills on a global stage."
    ],
    "content_type": "history"
  },
  {
    "url": "https://www.fightbookmma.com/ufc-on-espn-50-venum-payout-jessica-andrade-top-earner-with-21000/",
    "input": "NASHVILLE, TENNESSEE – AUGUST 05: Jessica Andrade of Brazil prepares to fight Tatiana Suarez in a strawweight fight during the UFC Fight Night event at Bridgestone Arena on August 05, 2023 in Nashville, Tennessee. (Photo by Jeff Bottari/Zuffa LLC via Getty Images)",
    "output": [
      "<strong>Battle of Styles: Andrade vs Suarez</strong>",
      "The Brazilian fighter Jessica Andrade may face a tough challenge in her upcoming strawweight fight against Tatiana Suarez. While Andrade is known for her aggression and powerful striking, Suarez is a dominant wrestler with an undefeated record. Many fans expect Suarez to use her wrestling skills to control the fight and potentially submit Andrade. However, in the unpredictable world of mixed martial arts, anything can happen, and Andrade could surprise everyone with her resilience and knockout power. It will be interesting to see if Andrade can overcome the odds and secure a victory against Suarez."
    ],
    "content_type": "contrarian viewpoint"
  },
  {
    "url": "http://localhost:3000/mma5.html",
    "input": "NASHVILLE, TENNESSEE – AUGUST 05: Jessica Andrade of Brazil prepares to fight Tatiana Suarez in a strawweight fight during the UFC Fight Night event at Bridgestone Arena on August 05, 2023 in Nashville, Tennessee. (Photo by Jeff Bottari/Zuffa LLC via Getty Images)",
    "output": [
      "<strong>Battle of Styles: Andrade vs Suarez</strong>",
      "The Brazilian fighter Jessica Andrade may face a tough challenge in her upcoming strawweight fight against Tatiana Suarez. While Andrade is known for her aggression and powerful striking, Suarez is a dominant wrestler with an undefeated record. Many fans expect Suarez to use her wrestling skills to control the fight and potentially submit Andrade. However, in the unpredictable world of mixed martial arts, anything can happen, and Andrade could surprise everyone with her resilience and knockout power. It will be interesting to see if Andrade can overcome the odds and secure a victory against Suarez."
    ],
    "content_type": "contrarian viewpoint"
  },
  {
    "url": "https://www.fightbookmma.com/5-of-the-best-texas-boxers/",
    "input": "On March 31st, 1878, John Arthur Johnson, better known as Jack Johnson, was born. Johnson went on to become the first black heavyweight champion of the world between 1908 and 1915. The fighter nicknamed the “Galveston Giant” is regarded as being one of the sport’s most influential figures. His most famous fight came in 1910 when he defeated Jim Jeffries in a fight dubbed “the Fight of the Century”.",
    "output": [
      "<strong>Breaking Barriers: Jack Johnson's Triumph</strong>",
      "Born in the era of racial segregation, Jack Johnson broke barriers as the first black heavyweight champion. His victory in the historic 1910 fight against Jim Jeffries symbolized more than just a boxing match—it represented a turning point in the fight against racial discrimination. Johnson's triumph paved the way for future black athletes and left an indelible mark on the history of sports and civil rights."
    ],
    "content_type": "history"
  },
  {
    "url": "https://www.fightbookmma.com/exclusive-with-promoter-dmitriy-salita-jarrell-miller-will-do-more-ppv-buys-than-dillian-whyte/",
    "input": "Speaking to OLBG, Miller said:",
    "output": [
      "<strong>OLBG: From Community to Betting Powerhouse</strong>",
      "Did you know that OLBG, the platform where Miller made his statement, has a rich history? Established in 2002, OLBG started as an online community of sports bettors sharing tips and advice. It quickly gained popularity and became a go-to resource for sports enthusiasts. Over the years, OLBG has evolved into a comprehensive sports betting platform, providing expert analysis, tips, and recommendations to millions of users worldwide. With a strong foundation in the world of sports, OLBG has undoubtedly made its mark in the history of online betting."
    ],
    "content_type": "history"
  },
  {
    "url": "https://www.fightbookmma.com/5-of-the-best-texas-boxers/",
    "input": "Texas has a long history of having some of the best boxers in the world. This can, in some parts, be put down to the sport’s development in the late 19th century. Despite being illegal in most American states, Texas was known for its boxing and produced one of the greatest fighters in history.",
    "output": [
      "<strong>Texas: Birthplace of Gloved Boxing</strong>",
      "Texas is not only known for its rich history in boxing, but also for its unique boxing trivia. Did you know that the world's first heavyweight championship fight using gloves took place in Texas? It happened on April 17, 1867, in Houston, where John C. Heenan and Tom Sayers battled it out for 37 rounds. This historic event marked a significant milestone in the evolution of boxing as a sport."
    ],
    "content_type": "trivia"
  },
  {
    "url": "https://www.fightbookmma.com/ufc-on-espn-50-bonus-winners-sandhagen-vs-font/",
    "input": "UFC officials announced the bonus winners after the event. All fighters took home an extra $50k that night.",
    "output": [
      "<strong>Groundbreaking UFC Event: Gracie's Victory</strong>",
      "The first-ever UFC event took place on November 12, 1993, in Denver, Colorado. It featured a unique tournament-style format with fighters from various disciplines competing against each other. One of the most memorable moments from that night was Royce Gracie, a Brazilian Jiu-Jitsu specialist, winning the tournament and showcasing the effectiveness of his grappling skills. This groundbreaking event laid the foundation for the sport of mixed martial arts as we know it today."
    ],
    "content_type": "tangential tidbits"
  },
  {
    "url": "https://www.fightbookmma.com/watch-sitting-ringside-ep-183-at-9-p-m-et-on-august-4/",
    "input": "We will start by announcing the events scheduled for this weekend. We will give our UFC 291: Poirier vs. Gaethje 2. We will also have our segment called “Outside The Cage News” as we talk about fight bookings and other news. We will end the show by giving our grades on the fight poster and our predictions for UFC on ESPN 50: Sandhagen vs. Font. So grab a drink, sit back, relax, and hang out with us and if you want to join us let us know on our live streams.",
    "output": [
      "<strong>On The Other Fist</strong>",
      "Not everyone is a fan of MMA events like UFC 291. Some people find the violent nature of these fights disturbing and believe that they promote a culture of aggression. Additionally, critics argue that the high levels of physical contact in UFC fights contribute to long-term health issues for the athletes involved. ",
      "What would you say to those critics?"
    ],
    "content_type": "contrarian viewpoint"
  },
  {
    "url": "https://www.fightbookmma.com/breaking-33-of-mma-fans-think-they-can-last-one-round-with-conor-mcgregor-whilst-68-believe-he-will-be-champion-again/",
    "input": "Well according to Action Network. A third of Sports fans think they can go toe-to-toe with ”The Notorious One,” for one whole round!",
    "output": [
      "<strong>The McGregor Phenomenon</strong>",
      "It's not just sports fans who believe they can hold their own against Conor McGregor in the ring. In fact, legendary boxer Mike Tyson once jokingly said, \"I would fight him for free.\" While Tyson's comment may have been light-hearted, it goes to show the impact McGregor has had on the sports world. His charisma, skill, and larger-than-life personality have made him both loved and loathed by fans and fighters alike. Whether you believe you could last a round with McGregor or not, there's no denying the lasting impression he's made on combat sports."
    ],
    "content_type": "tangential tidbits"
  },
  {
    "url": "https://www.fightbookmma.com/mma-veteran-zach-makovsky-wants-to-roll-back-the-years-at-brave-cf-73/",
    "input": "Zach Makovsky will hope to turn back the clock when he locks horns with Flavio de Queiroz at BRAVE CF 73.",
    "output": [
      "\"Turning Back the Clock: Makovsky's Moment\"",
      "In the world of mixed martial arts, there have been several instances where fighters have defied the odds and successfully turned back the clock. From legends like Randy Couture to current stars like Anderson Silva, the ability to tap into past greatness and exhibit a dominant performance is a testament to their skill and determination. Zach Makovsky will now step into the cage against Flavio de Queiroz, hoping to add his name to this list of fighters who have made history by turning back the clock. As the fight unfolds, fans will be on the edge of their seats, eagerly anticipating whether Makovsky can summon his past glory and showcase the skills that made him a standout in the sport."
    ],
    "content_type": "history"
  },
  {
    "url": "https://www.fightbookmma.com/the-ultimate-experience-weekend-coming-to-atlantic-city-from-august-25-august-27/",
    "input": "On August 26th, immerse yourself in the world of boxing with “The Road to Victory” Boxing Show. Witness an adrenaline-pumping spectacle as elite fighters battle it out for supremacy in the ring. The highlight of the night will be the Main Event, where two formidable contenders, Derrick “Take it to the Bank” Webster, and Shady Gamhour, will compete fiercely for the NBA World Title Belt. Both of these exceptional fighters have been under the tutelage of the Legendary Roy Jones Jr., who will also be in attendance and in the corner of Shady Gamhour. Experience the thrill of victory and the agony of defeat as these fighters give it their all in the pursuit of glory.",
    "output": [
      "<strong>The Evolution of Boxing: Ancient Origins to Modern Controversies</strong>",
      "- Did you know that boxing has been a part of the Olympic Games since ancient times? The sport was first introduced in the 23rd Olympiad of 688 BC and has remained a staple ever since. It's interesting to think about how the boxing techniques and rules have evolved over thousands of years.",
      "- Boxing gloves weren't always used in the sport. In the early days, fighters would compete bare-knuckled, resulting in more brutal and dangerous matches. It wasn't until the late 19th century that padded gloves were introduced to protect the fighters' hands and reduce the severity of injuries.",
      "- Boxing has been a source of inspiration for many other sports and forms of entertainment. The concept of a knockout, where a fighter is rendered unconscious and unable to continue, has been adopted in various combat sports. Additionally, boxing has influenced the creation of video games, movies, and even workout routines."
    ],
    "content_type": "tangential tidbits"
  },
  {
    "url": "https://www.fightbookmma.com/ufc-on-espn-50-results-sandhagen-vs-font/",
    "input": "In the main event, Cory Sandhagen fighting out of Aurora, Colorado will face Rob Font fighting out of Boston, Massachusetts. In the co-main event, we will see Jessica Andrade fighting out of Parana, Brazil take on Tatiana Suarez fighting out of Rancho Cucamonga, California.",
    "output": [
      "<strong>Octagon Showdown: Sandhagen vs. Font</strong>",
      "- Both Cory Sandhagen and Rob Font have impressive records in the octagon, with Sandhagen boasting a 14-3 record and Font holding a 19-4 record.",
      "- Jessica Andrade, known as \"Bate Estaca\" (which means \"pile driver\" in Portuguese), is a former UFC Strawweight Champion. She is known for her aggressive fighting style and knockout power.",
      "- Tatiana Suarez is a highly decorated wrestler and has an undefeated record of 8-0. She won the gold medal in wrestling at the 2011 Pan American Games."
    ],
    "content_type": "tangential tidbits"
  },
  {
    "url": "https://www.fightbookmma.com/ufc-on-espn-50-results-sandhagen-vs-font/",
    "input": "FigtBook MMA has your results for UFC on ESPN: Sandhagen vs. Font (also known as UFC on ESPN 50). This event will take place on August 5, 2023, at Bridgestone Arena in Nashville, Tennessee, United States.",
    "output": [
      "<strong>Bridgestone Arena: MMA's Hottest Venue</strong>",
      "Did you know that the Bridgestone Arena in Nashville, Tennessee has hosted a total of 12 UFC events since its opening in 1996? It is not only a popular venue for mixed martial arts, but also for other sports and entertainment events. The arena has a seating capacity of approximately 17,500 for UFC events, providing an electrifying atmosphere for fans."
    ],
    "content_type": "trivia"
  },
  {
    "url": "https://www.fightbookmma.com/exclusive-with-promoter-dmitriy-salita-jarrell-miller-will-do-more-ppv-buys-than-dillian-whyte/",
    "input": "Jarell Miller has served his time for using PED’s – he deserves the opportunity to fight",
    "output": [
      "<strong>Sports' PED Dilemma: Redemption or Rejection?</strong>",
      "Despite Jarell Miller's controversial past involving the use of performance-enhancing drugs (PEDs), it is important to consider the historical context of such incidents in the world of sports. Throughout history, various athletes have faced similar challenges, prompting discussions around the appropriate punishment and subsequent opportunities for redemption. The case of Jarell Miller serves as a reminder that the sports industry has grappled with PED use for decades, highlighting the ongoing struggle to strike a balance between accountability and second chances."
    ],
    "content_type": "history"
  },
  {
    "url": "https://www.fightbookmma.com/granite-chin-promotions-signs-unbeaten-new-england-based-prospects-james-perkins-kenny-larson/",
    "input": "Perkins, of Lynn (MA), and Salem’s (MA) Larson both train at Broadway Boxing Club in Everett (MA) and are managed by Dennis Willcox.",
    "output": [
      "<strong>Bonded by Boxing: Perkins and Larson</strong>",
      "Perkins and Larson, both hailing from Massachusetts, share more than just a training gym and manager. They have a common passion for boxing that brings them together at the Broadway Boxing Club in Everett. It's not just about the punches and the sweat for these two, but also the bond they have formed through their shared dedication to the sport."
    ],
    "content_type": "trivia"
  },
  {
    "url": "https://www.fightbookmma.com/ufc-on-espn-50-results-sandhagen-vs-font/",
    "input": "The main card begins at 9 p.m. ET and airs on ESPN, as well as ESPN+. The prelims air on ESPN and stream on ESPN+ beginning at 6 p.m. ET.",
    "output": [
      "<strong>UFC: From Humble Beginnings to Global Sensation</strong>",
      "The first ever UFC event took place on November 12, 1993. It was titled \"UFC 1: The Beginning\" and featured a tournament-style format with fighters from various disciplines. The event took place in Denver, Colorado and was originally created to determine the most effective martial art in a real fight. Today, the UFC is a global phenomenon with millions of fans worldwide."
    ],
    "content_type": "trivia"
  }
]
